{"total":115,"data":[{"id":1,"quote":"Talk is cheap. Show me the code.","author":"Linus Torvalds"},{"id":2,"quote":"Programs must be written for people to read, and only incidentally for machines to execute.","author":"Harold Abelson"},{"id":3,"quote":"Always code as if the guy who ends up maintaining your code will be a violent psychopath who knows where you live","author":"John Woods"},{"id":4,"quote":"Programming today is a race between software engineers striving to build bigger and better idiot-proof programs, and the Universe trying to produce bigger and better idiots. So far, the Universe is winning.","author":"Rick Cook"},{"id":5,"quote":"Any fool can write code that a computer can understand. Good programmers write code that humans can understand.","author":"Martin Fowler"},{"id":6,"quote":"Well, Mr. Frankel, who started this program, began to suffer from the computer disease that anybody who works with computers now knows about. It's a very serious disease and it interferes completely with the work. The trouble with computers is you *play* with them. They are so wonderful. You have these switches - if it's an even number you do this, if it's an odd number you do that - and pretty soon you can do more and more elaborate things if you are clever enough, on one machine.","author":"Richard P. Feynman"},{"id":7,"quote":"The best programs are written so that computing machines can perform them quickly and so that human beings can understand them clearly. A programmer is ideally an essayist who works with traditional aesthetic and literary forms as well as mathematical concepts, to communicate the way that an algorithm works and to convince a reader that the results will be correct.","author":"Donald E. Knuth"},{"id":8,"quote":"Punishments include such things as flashbacks, flooding of unbearable emotions, painful body memories, flooding of memories in which the survivor perpetrated against others, self-harm, and suicide attempts.","author":"Alison Miller"},{"id":9,"quote":"I'm not a great programmer; I'm just a good programmer with great habits.","author":"Kent Beck"},{"id":10,"quote":"Truth can only be found in one place: the code.","author":"Robert C. Martin"}]}